package com.h0tk3y.spbsu.kotlin.course.lesson1

fun greet(name: String) {
/**
 * Напишите тело функции, выводящее приветствие в виде:
 * "Hello, ...!" без кавычек, подставляя вместо "..."
 * переданное имя, преобразованное следующим образом:
 *
 * Если в переданной строке ровно один пробел, то считайте строку фамилией и именем и поменяйте местами
 * части строки слева и справа от пробела. Например, если name = "Ivanov Ivan", то
 * нужно вывести "Hello, Ivan Ivanov!". Иначе используйте строку как есть.
 *
 * Доступ к i-му символу строки можно получить, используя оператор: name[i].
 * Проверить, является ли символ пробелом (' '), можно с помощью сравнения (==). 
 *
 * Для операции взятия подстроки по индексам используйте
 * name.substring(startIndex, endIndex), где нумерация символов с нуля, а символ на позиции
 * endIndex не включается в результат.
 */
}

fun main(args: Array<String>) {
/**
 * Вызовите функцию greet для каждого
 * аргумента командной строки или же, если не
 * передано ни одного аргумента, вызовите greet один
 * раз, чтобы вывести "Hello, world!"
 */
}